{"class_name": "Sequential", "config": [{"class_name": "TimeDistributed", "config": {"batch_input_shape": [null, 777, 39, 3, 1], "trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "padding": "valid", "activation": "linear", "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "data_format": "channels_last", "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_size": [3, 3], "strides": [1, 1], "bias_regularizer": null, "trainable": true, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null}}, "dtype": "float32"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_2", "layer": {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "trainable": true, "name": "bidirectional_1", "layer": {"class_name": "GRU", "config": {"unroll": false, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "recurrent_constraint": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "recurrent_dropout": 0.5, "units": 512, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "activation": "tanh", "name": "gru_1", "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "go_backwards": false, "return_state": false, "dropout": 0.5, "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "activity_regularizer": null}}}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "trainable": true, "name": "bidirectional_2", "layer": {"class_name": "GRU", "config": {"unroll": false, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "recurrent_constraint": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "recurrent_dropout": 0.5, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "activation": "tanh", "name": "gru_2", "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "go_backwards": false, "return_state": false, "dropout": 0.5, "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "activity_regularizer": null}}}}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "trainable": true, "name": "bidirectional_3", "layer": {"class_name": "GRU", "config": {"unroll": false, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "recurrent_constraint": null, "implementation": 0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "recurrent_dropout": 0.5, "units": 128, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "activation": "tanh", "name": "gru_3", "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "stateful": false, "go_backwards": false, "return_state": false, "dropout": 0.5, "kernel_regularizer": null, "recurrent_regularizer": null, "return_sequences": true, "activity_regularizer": null}}}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_3", "layer": {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "activation": "softmax", "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "kernel_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 40, "kernel_regularizer": null}}}}], "keras_version": "2.0.8", "backend": "tensorflow"}