{"config": [{"config": {"dtype": "float32", "trainable": true, "batch_input_shape": [null, 777, 39], "merge_mode": "concat", "name": "bidirectional_1", "layer": {"config": {"activation": "tanh", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_dropout": 0.5, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_regularizer": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "stateful": false, "units": 512, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dropout": 0.5, "bias_constraint": null, "recurrent_constraint": null, "kernel_regularizer": null, "name": "gru_1", "return_sequences": true, "go_backwards": false, "trainable": true, "activity_regularizer": null, "implementation": 0}, "class_name": "GRU"}}, "class_name": "Bidirectional"}, {"config": {"merge_mode": "concat", "name": "bidirectional_2", "trainable": true, "layer": {"config": {"activation": "tanh", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_dropout": 0.5, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_regularizer": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "stateful": false, "units": 256, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dropout": 0.5, "bias_constraint": null, "recurrent_constraint": null, "kernel_regularizer": null, "name": "gru_2", "return_sequences": true, "go_backwards": false, "trainable": true, "activity_regularizer": null, "implementation": 0}, "class_name": "GRU"}}, "class_name": "Bidirectional"}, {"config": {"merge_mode": "concat", "name": "bidirectional_3", "trainable": true, "layer": {"config": {"activation": "tanh", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_dropout": 0.5, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_regularizer": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "stateful": false, "units": 128, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dropout": 0.5, "bias_constraint": null, "recurrent_constraint": null, "kernel_regularizer": null, "name": "gru_3", "return_sequences": true, "go_backwards": false, "trainable": true, "activity_regularizer": null, "implementation": 0}, "class_name": "GRU"}}, "class_name": "Bidirectional"}, {"config": {"merge_mode": "concat", "name": "bidirectional_4", "trainable": true, "layer": {"config": {"activation": "tanh", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "recurrent_dropout": 0.5, "recurrent_activation": "hard_sigmoid", "use_bias": true, "recurrent_regularizer": null, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "stateful": false, "units": 128, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dropout": 0.5, "bias_constraint": null, "recurrent_constraint": null, "kernel_regularizer": null, "name": "gru_4", "return_sequences": true, "go_backwards": false, "trainable": true, "activity_regularizer": null, "implementation": 0}, "class_name": "GRU"}}, "class_name": "Bidirectional"}, {"config": {"name": "time_distributed_1", "trainable": true, "layer": {"config": {"bias_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "units": 40, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "theano"}