{"config": [{"config": {"layer": {"config": {"activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "kernel_regularizer": null, "trainable": true, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "data_format": "channels_last", "name": "conv2d_1", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "padding": "valid", "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, "trainable": true, "name": "time_distributed_1", "batch_input_shape": [null, 777, 39, 3, 1], "dtype": "float32"}, "class_name": "TimeDistributed"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"layer": {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, "trainable": true, "name": "time_distributed_2"}, "class_name": "TimeDistributed"}, {"config": {"layer": {"config": {"activation": "tanh", "implementation": 0, "kernel_regularizer": null, "units": 512, "recurrent_activation": "hard_sigmoid", "trainable": true, "kernel_constraint": null, "go_backwards": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.5, "recurrent_regularizer": null, "return_sequences": true, "recurrent_dropout": 0.5, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "gru_1", "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "unroll": false}, "class_name": "GRU"}, "merge_mode": "concat", "trainable": true, "name": "bidirectional_1"}, "class_name": "Bidirectional"}, {"config": {"layer": {"config": {"activation": "tanh", "implementation": 0, "kernel_regularizer": null, "units": 256, "recurrent_activation": "hard_sigmoid", "trainable": true, "kernel_constraint": null, "go_backwards": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.5, "recurrent_regularizer": null, "return_sequences": true, "recurrent_dropout": 0.5, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "gru_2", "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "unroll": false}, "class_name": "GRU"}, "merge_mode": "concat", "trainable": true, "name": "bidirectional_2"}, "class_name": "Bidirectional"}, {"config": {"layer": {"config": {"activation": "tanh", "implementation": 0, "kernel_regularizer": null, "units": 128, "recurrent_activation": "hard_sigmoid", "trainable": true, "kernel_constraint": null, "go_backwards": false, "activity_regularizer": null, "bias_constraint": null, "recurrent_constraint": null, "dropout": 0.5, "recurrent_regularizer": null, "return_sequences": true, "recurrent_dropout": 0.5, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "gru_3", "stateful": false, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_state": false, "unroll": false}, "class_name": "GRU"}, "merge_mode": "concat", "trainable": true, "name": "bidirectional_3"}, "class_name": "Bidirectional"}, {"config": {"layer": {"config": {"activation": "softmax", "trainable": true, "units": 40, "kernel_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "name": "dense_1"}, "class_name": "Dense"}, "trainable": true, "name": "time_distributed_3"}, "class_name": "TimeDistributed"}], "backend": "theano", "class_name": "Sequential", "keras_version": "2.0.6"}