{"class_name": "Sequential", "config": [{"class_name": "Bidirectional", "config": {"batch_input_shape": [null, 777, 39], "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_1", "go_backwards": false, "stateful": false, "implementation": 0, "use_bias": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.5, "units": 512, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "dropout": 0.5, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null}}, "name": "bidirectional_1", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_2", "go_backwards": false, "stateful": false, "implementation": 0, "use_bias": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.5, "units": 256, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "dropout": 0.5, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null}}, "name": "bidirectional_2", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_3", "go_backwards": false, "stateful": false, "implementation": 0, "use_bias": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.5, "units": 128, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "dropout": 0.5, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null}}, "name": "bidirectional_3", "merge_mode": "concat"}}, {"class_name": "Bidirectional", "config": {"trainable": true, "layer": {"class_name": "LSTM", "config": {"trainable": true, "unit_forget_bias": true, "return_sequences": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "lstm_4", "go_backwards": false, "stateful": false, "implementation": 0, "use_bias": true, "activation": "tanh", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_activation": "hard_sigmoid", "recurrent_dropout": 0.5, "units": 128, "return_state": false, "recurrent_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "dropout": 0.5, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_regularizer": null}}, "name": "bidirectional_4", "merge_mode": "concat"}}, {"class_name": "TimeDistributed", "config": {"trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"trainable": true, "units": 40, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "activation": "softmax", "kernel_constraint": null, "kernel_regularizer": null, "bias_regularizer": null}}}}], "backend": "theano", "keras_version": "2.0.6"}