{"keras_version": "2.0.6", "backend": "theano", "config": [{"config": {"trainable": true, "dtype": "float32", "merge_mode": "concat", "batch_input_shape": [null, 777, 39], "name": "bidirectional_1", "layer": {"config": {"return_state": false, "activity_regularizer": null, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "bias_constraint": null, "units": 512, "trainable": true, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "bias_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.5, "recurrent_dropout": 0.5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "name": "gru_1", "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "GRU"}}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "bidirectional_2", "layer": {"config": {"return_state": false, "activity_regularizer": null, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "bias_constraint": null, "units": 256, "trainable": true, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "bias_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.5, "recurrent_dropout": 0.5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "name": "gru_2", "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "GRU"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "bidirectional_3", "layer": {"config": {"return_state": false, "activity_regularizer": null, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "bias_constraint": null, "units": 128, "trainable": true, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "bias_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.5, "recurrent_dropout": 0.5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "name": "gru_3", "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "GRU"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "bidirectional_4", "layer": {"config": {"return_state": false, "activity_regularizer": null, "return_sequences": true, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unroll": false, "bias_constraint": null, "units": 128, "trainable": true, "stateful": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "go_backwards": false, "bias_regularizer": null, "use_bias": true, "recurrent_activation": "hard_sigmoid", "dropout": 0.5, "recurrent_dropout": 0.5, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "tanh", "kernel_constraint": null, "recurrent_regularizer": null, "name": "gru_4", "kernel_regularizer": null, "implementation": 0, "recurrent_constraint": null}, "class_name": "GRU"}, "merge_mode": "concat"}, "class_name": "Bidirectional"}, {"config": {"trainable": true, "name": "time_distributed_1", "layer": {"config": {"trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activation": "softmax", "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "units": 40}, "class_name": "Dense"}}, "class_name": "TimeDistributed"}], "class_name": "Sequential"}