{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_2", "config": {"batch_input_shape": [null, null], "name": "input_2", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 80, 4096], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "embedding_1", "config": {"input_length": null, "embeddings_constraint": null, "name": "embedding_1", "mask_zero": false, "batch_input_shape": [null, null], "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "trainable": true, "embeddings_regularizer": null, "dtype": "float32", "activity_regularizer": null, "input_dim": 1001}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_1", "config": {"stateful": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "trainable": true, "activation": "relu", "implementation": 0, "return_sequences": true, "units": 4096, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "return_state": true, "bias_regularizer": null, "unroll": false, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "lstm_2", "config": {"stateful": false, "recurrent_activation": "hard_sigmoid", "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "trainable": true, "activation": "relu", "implementation": 0, "return_sequences": true, "units": 4096, "activity_regularizer": null, "recurrent_constraint": null, "kernel_regularizer": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "recurrent_regularizer": null, "name": "lstm_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "return_state": false, "bias_regularizer": null, "unroll": false, "go_backwards": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}}, "inbound_nodes": [[["embedding_1", 0, 0, {}], ["lstm_1", 0, 1, {}], ["lstm_1", 0, 2, {}]]]}, {"class_name": "Dot", "name": "dot_1", "config": {"axes": 2, "name": "dot_1", "trainable": true, "normalize": false}, "inbound_nodes": [[["lstm_2", 0, 0, {}], ["lstm_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dot_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "rate": 0.35}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Permute", "name": "permute_1", "config": {"name": "permute_1", "trainable": true, "dims": [2, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dot", "name": "dot_2", "config": {"axes": 2, "name": "dot_2", "trainable": true, "normalize": false}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["permute_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "inbound_nodes": [[["dot_2", 0, 0, {}], ["lstm_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "tanh"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"name": "dropout_2", "trainable": true, "rate": 0.35}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "kernel_constraint": null, "units": 1001, "bias_regularizer": null, "trainable": true, "activation": "softmax", "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "keras_version": "2.0.8"}