{"keras_version": "2.0.8", "backend": "tensorflow", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["dense_1", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 80, 4096], "sparse": false}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"dtype": "float32", "name": "input_2", "batch_input_shape": [null, 80], "sparse": false}, "name": "input_2", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"config": {"dtype": "float32", "trainable": true, "name": "embedding_1", "batch_input_shape": [null, null], "embeddings_regularizer": null, "output_dim": 300, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "mask_zero": false, "input_dim": 1001, "input_length": null, "activity_regularizer": null, "embeddings_constraint": null}, "name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"name": "gru_1", "activation": "relu", "recurrent_constraint": null, "return_sequences": true, "dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": true, "recurrent_dropout": 0.0, "stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "units": 1024, "use_bias": true, "unroll": false, "implementation": 0, "go_backwards": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null}, "name": "gru_1", "class_name": "GRU", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"output_shape": null, "output_mask": null, "name": "merge_1", "mode": "mul", "arguments": {}, "concat_axis": -1, "output_mask_type": "raw", "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}, "name": "merge_1", "class_name": "Merge", "inbound_nodes": [[["dropout_1", 0, 0, {"mask": [null, null]}], ["input_1", 0, 0, {"mask": [null, null]}]]]}, {"config": {"name": "gru_2", "activation": "relu", "recurrent_constraint": null, "return_sequences": true, "dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "recurrent_dropout": 0.0, "stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_constraint": null, "units": 1024, "use_bias": true, "unroll": false, "implementation": 0, "go_backwards": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null}, "name": "gru_2", "class_name": "GRU", "inbound_nodes": [[["embedding_1", 0, 0, {}], ["gru_1", 0, 1, {}]]]}, {"config": {"output_shape": null, "output_mask": null, "name": "merge_2", "mode": "concat", "arguments": {}, "concat_axis": -1, "output_mask_type": "raw", "output_shape_type": "raw", "dot_axes": -1, "mode_type": "raw"}, "name": "merge_2", "class_name": "Merge", "inbound_nodes": [[["merge_1", 0, 0, {"mask": [null, null]}], ["gru_2", 0, 0, {"mask": [null, null]}]]]}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["merge_2", 0, 0, {}]]]}, {"config": {"trainable": true, "name": "dense_1", "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_constraint": null, "units": 1001, "use_bias": true, "bias_regularizer": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}]}}