{"keras_version": "2.0.8", "config": {"output_layers": [["dense_2", 0, 0]], "name": "model_2", "layers": [{"config": {"batch_input_shape": [null, 80, 4096], "sparse": false, "name": "input_3", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_3", "inbound_nodes": []}, {"config": {"trainable": true, "name": "activation_2", "activation": "softmax"}, "class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"batch_input_shape": [null, 80], "sparse": false, "name": "input_4", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_4", "inbound_nodes": []}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_3"}, "class_name": "Dropout", "name": "dropout_3", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "name": "embedding_2", "batch_input_shape": [null, null], "trainable": true, "embeddings_constraint": null, "mask_zero": false, "input_dim": 1001, "input_length": null, "output_dim": 300, "embeddings_initializer": {"config": {"seed": null, "maxval": 0.05, "minval": -0.05}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "dtype": "float32"}, "class_name": "Embedding", "name": "embedding_2", "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"config": {"go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_state": true, "recurrent_dropout": 0.0, "use_bias": true, "units": 1024, "stateful": false, "unroll": false, "name": "gru_3", "dropout": 0.0, "activation": "relu", "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "trainable": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null}, "class_name": "GRU", "name": "gru_3", "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"config": {"output_shape_type": "raw", "dot_axes": -1, "mode": "mul", "name": "merge_3", "concat_axis": -1, "output_mask": null, "mode_type": "raw", "arguments": {}, "output_shape": null, "output_mask_type": "raw"}, "class_name": "Merge", "name": "merge_3", "inbound_nodes": [[["dropout_3", 0, 0, {"mask": [null, null]}], ["input_3", 0, 0, {"mask": [null, null]}]]]}, {"config": {"go_backwards": false, "implementation": 0, "kernel_regularizer": null, "return_state": false, "recurrent_dropout": 0.0, "use_bias": true, "units": 1024, "stateful": false, "unroll": false, "name": "gru_4", "dropout": 0.0, "activation": "relu", "bias_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "trainable": true, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "kernel_constraint": null, "recurrent_regularizer": null, "recurrent_constraint": null}, "class_name": "GRU", "name": "gru_4", "inbound_nodes": [[["embedding_2", 0, 0, {}], ["gru_3", 0, 1, {}]]]}, {"config": {"output_shape_type": "raw", "dot_axes": -1, "mode": "concat", "name": "merge_4", "concat_axis": -1, "output_mask": null, "mode_type": "raw", "arguments": {}, "output_shape": null, "output_mask_type": "raw"}, "class_name": "Merge", "name": "merge_4", "inbound_nodes": [[["merge_3", 0, 0, {"mask": [null, null]}], ["gru_4", 0, 0, {"mask": [null, null]}]]]}, {"config": {"trainable": true, "rate": 0.5, "name": "dropout_4"}, "class_name": "Dropout", "name": "dropout_4", "inbound_nodes": [[["merge_4", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "units": 1001, "bias_regularizer": null, "name": "dense_2", "activation": "softmax", "bias_constraint": null}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0], ["input_4", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}